In [1]:
import seaborn as sns

df = sns.load_dataset('titanic')
print(df.head())    # 상위 5개 열 출력
print() 
print(df.tail())    # 하위 5개 열 출력 
print()
print(df.shape)
print(df.info())
print()

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

     survived  pclass     sex   age  sibsp  parch   fare embarked   class  \
886         0       2    male  27.0      0      0  13.00        S  Second
887         1       1  female  19.0      0      0  30.00        S   First
888         0       3  female   NaN      1      2  23.45        S   Third
889         1       1    male  26.0      0      0  30.00        C   First
890         0       3    male  32.0      0      0   7.75        Q   Third

       who  adult_male deck  embark_town alive  alone
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

(891, 15)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB
None

In [2]:
print(df['sex'].value_counts()) #df[열이름], df.loc[행 이름]
print()
print(df[["sex", "survived"]].value_counts())   
print()
print(df[["sex", "survived"]].value_counts(normalize=True).sort_index())    # normalize = True는 분포 비율 계산

sex
male      577
female    314
Name: count, dtype: int64

sex     survived
male    0           468
female  1           233
male    1           109
female  0            81
Name: count, dtype: int64

sex     survived
female  0           0.090909
        1           0.261504
male    0           0.525253
        1           0.122334
Name: proportion, dtype: float64

In [5]:
df[["survived", "age"]].mean()

survived     0.383838
age         29.699118
dtype: float64

In [6]:
print(df["fare"].min())
print(df["fare"].max())
print(df["fare"].median())

0.0
512.3292
14.4542

In [11]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB
None

In [14]:
# 결측치 처리하기
print(df.dropna())
print()
print(df.dropna(subset=["age"], axis = 0))  # "age" 열에서 결측치가 있는 데이터만 삭제, axis = 0 이므로 행 기준 정렬
print()
print(df.dropna(axis = 1))  # axis = 1 이므로 열 기준 정렬

     survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
1           1       1  female  38.0      1      0  71.2833        C  First
3           1       1  female  35.0      1      0  53.1000        S  First
6           0       1    male  54.0      0      0  51.8625        S  First
10          1       3  female   4.0      1      1  16.7000        S  Third
11          1       1  female  58.0      0      0  26.5500        S  First
..        ...     ...     ...   ...    ...    ...      ...      ...    ...
871         1       1  female  47.0      1      1  52.5542        S  First
872         0       1    male  33.0      0      0   5.0000        S  First
879         1       1  female  56.0      0      1  83.1583        C  First
887         1       1  female  19.0      0      0  30.0000        S  First
889         1       1    male  26.0      0      0  30.0000        C  First

       who  adult_male deck  embark_town alive  alone
1    woman       False    C    Cherbourg   yes  False
3    woman       False    C  Southampton   yes  False
6      man        True    E  Southampton    no   True
10   child       False    G  Southampton   yes  False
11   woman       False    C  Southampton   yes   True
..     ...         ...  ...          ...   ...    ...
871  woman       False    D  Southampton   yes  False
872    man        True    B  Southampton    no   True
879  woman       False    C    Cherbourg   yes  False
887  woman       False    B  Southampton   yes   True
889    man        True    C    Cherbourg   yes   True

[182 rows x 15 columns]

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
885         0       3  female  39.0      0      5  29.1250        Q   Third
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
885  woman       False  NaN   Queenstown    no  False
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[714 rows x 15 columns]

     survived  pclass     sex  sibsp  parch     fare   class    who  \
0           0       3    male      1      0   7.2500   Third    man
1           1       1  female      1      0  71.2833   First  woman
2           1       3  female      0      0   7.9250   Third  woman
3           1       1  female      1      0  53.1000   First  woman
4           0       3    male      0      0   8.0500   Third    man
..        ...     ...     ...    ...    ...      ...     ...    ...
886         0       2    male      0      0  13.0000  Second    man
887         1       1  female      0      0  30.0000   First  woman
888         0       3  female      1      2  23.4500   Third  woman
889         1       1    male      0      0  30.0000   First    man
890         0       3    male      0      0   7.7500   Third    man

     adult_male alive  alone
0          True    no  False
1         False   yes  False
2         False   yes   True
3         False   yes  False
4          True    no   True
..          ...   ...    ...
886        True    no   True
887       False   yes   True
888       False    no  False
889        True   yes   True
890        True    no   True

[891 rows x 11 columns]

In [15]:
print(df.dropna(axis = 1, thresh= 300)) # 결측치 300개 이상 갖는 열을 삭제

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male  embark_town alive  alone
0      man        True  Southampton    no  False
1    woman       False    Cherbourg   yes  False
2    woman       False  Southampton   yes   True
3    woman       False  Southampton   yes  False
4      man        True  Southampton    no   True
..     ...         ...          ...   ...    ...
886    man        True  Southampton    no   True
887  woman       False  Southampton   yes   True
888  woman       False  Southampton    no  False
889    man        True    Cherbourg   yes   True
890    man        True   Queenstown    no   True

[891 rows x 14 columns]

In [23]:
# 결측치를 다른 값으로 대체하기 
df_2 = df.copy()
print(df_2.head(6))
print()
mean_age = df_2["age"].mean()
print(df_2["age"].fillna(mean_age))
print()
print(df_2["age"].head(6))

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third
5         0       3    male   NaN      0      0   8.4583        Q  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True
5    man        True  NaN   Queenstown    no   True

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: age, Length: 891, dtype: float64

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
Name: age, dtype: float64

In [26]:
df_2["deck_ffill"] = df_2["deck"].fillna(method = "ffill")  # ffill이란 결측치가 있는 경우 위의 행 중 결측치가 나타나기 전의 값으로 바꿔줌 
df_2["deck_bfill"] = df_2["deck"].fillna(method = "bfill")  # bfill이란 결측치가 있는 경우 아래의 행 중 결측치가 아닌 첫번째 값으로 바꿔줌 
print(df_2[["deck", "deck_ffill", "deck_bfill"]].head(12))

   deck deck_ffill deck_bfill
0   NaN        NaN          C
1     C          C          C
2   NaN          C          C
3     C          C          C
4   NaN          C          E
5   NaN          C          E
6     E          E          E
7   NaN          E          G
8   NaN          E          G
9   NaN          E          G
10    G          G          G
11    C          C          C

C:\Users\user\AppData\Local\Temp\ipykernel_21904\2571895674.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_2["deck_ffill"] = df_2["deck"].fillna(method = "ffill")  # ffill이란 결측치가 있는 경우 위의 행 중 결측치가 나타나기 전의 값으로 바꿔줌
C:\Users\user\AppData\Local\Temp\ipykernel_21904\2571895674.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_2["deck_bfill"] = df_2["deck"].fillna(method = "bfill")  # bfill이란 결측치가 있는 경우 아래의 행 중 결측치가 아닌 첫번째 값으로 바꿔줌

In [27]:
# 열을 인덱스(행)으로 다루기
import seaborn as sns

df = sns.load_dataset("mpg")
df.set_index("name", inplace = True)
print(df.head())

                            mpg  cylinders  displacement  horsepower  weight  \
name
chevrolet chevelle malibu  18.0          8         307.0       130.0    3504
buick skylark 320          15.0          8         350.0       165.0    3693
plymouth satellite         18.0          8         318.0       150.0    3436
amc rebel sst              16.0          8         304.0       150.0    3433
ford torino                17.0          8         302.0       140.0    3449

                           acceleration  model_year origin
name
chevrolet chevelle malibu          12.0          70    usa
buick skylark 320                  11.5          70    usa
plymouth satellite                 11.0          70    usa
amc rebel sst                      12.0          70    usa
ford torino                        10.5          70    usa

In [29]:
df.sort_index(inplace = True)   # 내림차순으로 정렬하고 싶을 때 : (inplace = True, ascending = False)
print(df.head())

                          mpg  cylinders  displacement  horsepower  weight  \
name
amc ambassador brougham  13.0          8         360.0       175.0    3821
amc ambassador dpl       15.0          8         390.0       190.0    3850
amc ambassador sst       17.0          8         304.0       150.0    3672
amc concord              24.3          4         151.0        90.0    3003
amc concord              19.4          6         232.0        90.0    3210

                         acceleration  model_year origin
name
amc ambassador brougham          11.0          73    usa
amc ambassador dpl                8.5          70    usa
amc ambassador sst               11.5          72    usa
amc concord                      20.1          80    usa
amc concord                      17.2          78    usa

In [30]:
df.reset_index(inplace = True)  # 인덱스 재설정
print(df.head())

                      name   mpg  cylinders  displacement  horsepower  weight  \
0  amc ambassador brougham  13.0          8         360.0       175.0    3821
1       amc ambassador dpl  15.0          8         390.0       190.0    3850
2       amc ambassador sst  17.0          8         304.0       150.0    3672
3              amc concord  24.3          4         151.0        90.0    3003
4              amc concord  19.4          6         232.0        90.0    3210

   acceleration  model_year origin
0          11.0          73    usa
1           8.5          70    usa
2          11.5          72    usa
3          20.1          80    usa
4          17.2          78    usa

In [31]:
#필터링
df = sns.load_dataset("mpg")
print(df["cylinders"].unique())

[8 4 6 3 5]

In [36]:
filter_bool = (df["cylinders"] == 6)
print(filter_bool.tail(10))

388    False
389     True
390    False
391    False
392    False
393    False
394    False
395    False
396    False
397    False
Name: cylinders, dtype: bool

In [38]:
print(df.loc[filter_bool,]) # 행 인덱스에 불리언 시리즈 대입

      mpg  cylinders  displacement  horsepower  weight  acceleration  \
15   22.0          6         198.0        95.0    2833          15.5
16   18.0          6         199.0        97.0    2774          15.5
17   21.0          6         200.0        85.0    2587          16.0
24   21.0          6         199.0        90.0    2648          15.0
33   19.0          6         232.0       100.0    2634          13.0
..    ...        ...           ...         ...     ...           ...
365  20.2          6         200.0        88.0    3060          17.1
366  17.6          6         225.0        85.0    3465          16.6
386  25.0          6         181.0       110.0    2945          16.4
387  38.0          6         262.0        85.0    3015          17.0
389  22.0          6         232.0       112.0    2835          14.7

     model_year origin                               name
15           70    usa                    plymouth duster
16           70    usa                         amc hornet
17           70    usa                      ford maverick
24           70    usa                        amc gremlin
33           71    usa                        amc gremlin
..          ...    ...                                ...
365          81    usa                    ford granada gl
366          81    usa             chrysler lebaron salon
386          82    usa              buick century limited
387          82    usa  oldsmobile cutlass ciera (diesel)
389          82    usa                     ford granada l

[84 rows x 9 columns]

In [43]:
filter_bool2 = (df["cylinders"] == 4) & (df["horsepower"] >= 100)
print(df.loc[filter_bool2, ["cylinders", "horsepower", "name"]])

     cylinders  horsepower              name
23           4       113.0          bmw 2002
76           4       112.0   volvo 145e (sw)
120          4       112.0       volvo 144ea
122          4       110.0         saab 99le
180          4       115.0         saab 99le
207          4       102.0         volvo 245
242          4       110.0          bmw 320i
271          4       105.0  plymouth sapporo
276          4       115.0        saab 99gle
323          4       105.0        dodge colt
357          4       100.0      datsun 200sx

In [46]:
filter_isin = df["name"].isin(["ford maverick", "ford mstang ii", "chevrolet impala"])
print(df.loc[filter_isin,].sort_values("horsepower"))

      mpg  cylinders  displacement  horsepower  weight  acceleration  \
155  15.0          6         250.0        72.0    3158          19.5
193  24.0          6         200.0        81.0    3012          17.6
17   21.0          6         200.0        85.0    2587          16.0
100  18.0          6         250.0        88.0    3021          16.5
103  11.0          8         400.0       150.0    4997          14.0
38   14.0          8         350.0       165.0    4209          12.0
62   13.0          8         350.0       165.0    4274          12.0
6    14.0          8         454.0       220.0    4354           9.0
126  21.0          6         200.0         NaN    2875          17.0

     model_year origin              name
155          75    usa     ford maverick
193          76    usa     ford maverick
17           70    usa     ford maverick
100          73    usa     ford maverick
103          73    usa  chevrolet impala
38           71    usa  chevrolet impala
62           72    usa  chevrolet impala
6            70    usa  chevrolet impala
126          74    usa     ford maverick